{
  "landing": {
    "title": "ROLLS & RESPONDERS",
    "subtitle": "Interactive Tabletop Exercise Tool",
    "selectScenario": "Select Scenario",
    "facilitatorConsole": "Facilitator Console",
    "facilitatorDesc": "Control the scenario, see hidden background info, trigger injects, and manage the game flow.",
    "playerDisplay": "Player Display",
    "playerDesc": "Launch this view on a shared screen. Shows public logs, dice rolls, and current scenario status.",
    "tip": "Tip: Open this URL in two separate tabs/windows to use both modes simultaneously."
  },
  "header": {
    "facilitator": "Facilitator",
    "turn": "Turn",
    "resetGame": "Reset Game",
    "exit": "Exit",
    "exitPlayerMode": "Exit Player Mode"
  },
  "facilitator": {
    "currentPhase": "Current Phase",
    "nextTurn": "Next Turn",
    "readToPlayers": "Read to Players",
    "resendToLog": "Re-send to Player Log",
    "facilitatorOnly": "Facilitator Eyes Only",
    "availableInjects": "Available Injects",
    "trigger": "TRIGGER",
    "actionResolution": "Action Resolution",
    "normalRoll": "Normal Roll",
    "advantage": "Advantage",
    "disadvantage": "Disadvantage",
    "rollTakeHigh": "Roll 2, Take High",
    "rollTakeLow": "Roll 2, Take Low",
    "difficulty": "Difficulty",
    "roll": "Roll",
    "example": "Example",
    "playerScreenLog": "Player Screen Log Preview",
    "noEvents": "No events yet...",
    "resetConfirm": "Reset the entire game? This will clear all progress and logs."
  },
  "player": {
    "incidentActive": "INCIDENT ACTIVE",
    "currentPhase": "Current Phase",
    "criticalUpdate": "Critical Update",
    "actionRollResult": "Action Roll Result",
    "waiting": "Waiting for facilitator updates...",
    "referenceData": "Reference Data",
    "difficultyChecks": "Difficulty Checks",
    "routine": "Routine",
    "challenging": "Challenging",
    "hard": "Hard",
    "turnStructure": "Turn Structure",
    "pastInject": "Past Inject"
  },
  "difficulty": {
    "trivial": "Trivial",
    "routine": "Routine",
    "challenging": "Challenging",
    "hard": "Hard",
    "eliteHacker": "Elite Hacker",
    "noRoll": "No Roll",
    "checkingComms": "Checking Slack/Email",
    "examiningLogs": "Examining Logs",
    "unfamiliarTool": "Unfamiliar Tool / Code Review",
    "restoringBackups": "Restoring locked backups / IAM Fix",
    "complexWizardry": "Highly complex technical wizardry"
  },
  "log": {
    "advancedTo": "Advanced to",
    "rolled": "Rolled",
    "actionRoll": "Action Roll:"
  },
  "scenarios": {
    "ddosAttack": {
      "title": "Scenario: Distributed Denial of Service (DDoS)",
      "difficulty": "Easy",
      "description": "A DDoS attack targets your organisation. The DDoS attack is from a paid stressor service hired by a group of criminals intending to extort your organisation for Bitcoin. Customers and senior stakeholders are becoming irritated.",
      "briefingTitle": "Briefing & Setup",
      "briefingPublic": "Welcome to the Tabletop Exercise.\n\nScenario: DDoS Attack\n\nRules:\n1. Discuss actions as a team.\n2. Facilitator sets Difficulty (Routine 5+, Challenging 10+, Hard 15+).\n3. Roll D20 to succeed.\n\nStatus: Normal operations.",
      "briefingFacilitator": "Prepare the team for a DDoS scenario. Ensure roles are assigned.",
      "turn1Title": "Turn 1: Pre-Incident",
      "turn1Public": "Staff members have begun receiving calls from customers complaining about being unable to use important services.",
      "turn1Facilitator": "BACKGROUND: A paid stressor service (hired by cyber criminals) is performing a DDoS attack against the organisation in the hopes of extorting Bitcoin (replace if not relevant to organisation).\n\nThe DDoS attack is targeting the organisation's website. The network traffic contains malformed HTTPS and is mostly coming from neighboring countries.",
      "turn2Title": "Turn 2: Incident Declared",
      "turn2Public": "Staff members are receiving calls, emails, and messages complaining about outages.",
      "turn2Facilitator": "BACKGROUND: The DDoS attacks continue. As a result, customers are getting agitated. Some senior staff members are now aware of the incident.\n\nThe criminals have sent an email demanding payment.",
      "turn3Title": "Turn 3: Recovery",
      "turn3Public": "The DDoS attack has ceased.\n\nSenior leadership and important stakeholders are requesting an incident summary.",
      "turn3Facilitator": "BACKGROUND: The attack has concluded. Media articles about your organisation's DDoS attack are circulating online.",
      "inject11Title": "Inject 11: Ransom Demand",
      "inject11Content": "A senior staff member receives an email from the criminals demanding the company pay (D20) Bitcoin to stop the DDoS attack.",
      "inject8Title": "Inject 8: Escalation Threat",
      "inject8Content": "Attacker sends an email including screenshots of social media complaints from your customers and threatens more cyber attacks if demands are not met (PRIVATE NOTE: GENUINE)",
      "inject6Title": "Inject 6: Stakeholder Call",
      "inject6Content": "An important stakeholder/board member calls for status"
    },
    "ransomware": {
      "title": "Scenario: Ransomware Attack",
      "difficulty": "Medium",
      "description": "Ransomware attack by hired security testers. Admin laptop compromised, user reported that machine boots into ransomware screen. Low-profile USB drive in one of the ports.",
      "briefingTitle": "Briefing & Setup",
      "briefingPublic": "Welcome to the Tabletop Exercise.\n\nScenario: Ransomware\n\nRules:\n1. Discuss actions as a team.\n2. Facilitator sets Difficulty (Routine 5+, Challenging 10+, Hard 15+).\n3. Roll D20 to succeed.\n\nStatus: Normal operations.",
      "briefingFacilitator": "Prepare the team for a ransomware scenario.",
      "turn1Title": "Turn 1: Pre-Incident",
      "turn1Public": "A member of staff has contacted IT, reporting that their machine is booting into a ransomware screen.\n\nThey have admin privileges.\n\nThe machine was working fine in the morning, user only noticed the issue after lunch.\n\nNo other reported issues.",
      "turn1Facilitator": "BACKGROUND: A security tester, hired by the business, has managed to gain access to the office area used by staff with admin privileges.\n\nThey have inserted a low-profile USB stick into one of the admin laptops while the user was away.\n\nIt has a ransomware payload, which has just deployed. The drive has been encrypted, but no data is being exfiltrated.",
      "turn2Title": "Turn 2: Response Phase",
      "turn2Public": "The staff member is panicking, worried they are going to lose their job. They keep coming to IT to ask if there's been any progress.\n\nMore users are reporting that their machines now have the same ransomware screens.",
      "turn2Facilitator": "BACKGROUND: The tester is still in the building, and has managed to infect D6 more machines.\n\nThe tester will leave later this turn.",
      "turn3Title": "Turn 3: Recovery",
      "turn3Public": "Fast-forward one week. Management discloses to the team that the ransomware event was part of a security test.",
      "turn3Facilitator": "BACKGROUND: The test has concluded.",
      "inject13Title": "Inject 13: Backup Issues",
      "inject13Content": "Hot backups do not work. Offsite backups will take (D6) hours to retrieve."
    },
    "cloudCompromise": {
      "title": "Scenario: Cloud Infrastructure Compromise",
      "difficulty": "Hard",
      "description": "The organisation has had their cloud infrastructure compromised by an attacker, leading to exfiltration of PII and unwanted media attention.",
      "briefingTitle": "Briefing & Setup",
      "briefingPublic": "Welcome to the Tabletop Exercise.\n\nScenario: Cloud Infrastructure Compromise\n\nRules:\n1. Discuss actions as a team.\n2. Facilitator sets Difficulty (Routine 5+, Challenging 10+, Hard 15+).\n3. Roll D20 to succeed.\n\nStatus: Normal operations.",
      "briefingFacilitator": "Prepare the team for a cloud compromise scenario involving PII.",
      "turn1Title": "Turn 1: Pre-Incident",
      "turn1Public": "The organisation's IT administrators have received an email from law enforcement notifying you of malicious connections to your cloud infrastructure.",
      "turn1Facilitator": "BACKGROUND: The organisation's cloud infrastructure was compromised due to a misconfiguration (exposed access keys).\n\nThe attacker has used this access to access a hosting bucket, downloading PII data on customers.",
      "turn2Title": "Turn 2: Response Phase",
      "turn2Public": "A staff member finds a screenshot on social media showing PII from the organisation's customers.",
      "turn2Facilitator": "BACKGROUND: The attacker has begun leaking samples of the PII on a darknet forum and is offering to sell the full dataset to anyone online. Screenshots of these samples are being posted on social media.\n\nThe attacker continues to have access until they are removed and prevented from regaining access (e.g. access key is rotated, and the misconfiguration is fixed).",
      "turn3Title": "Turn 3: Recovery",
      "turn3Public": "No further information (You may want to provide a summary of the current state of the attack).",
      "turn3Facilitator": "BACKGROUND: The attacker continues to have access until they are removed and prevented from regaining access.",
      "inject12Title": "Inject 12: Researcher Warning",
      "inject12Content": "A staff member finds an email from months ago in which a researcher details the misconfiguration (exposed access keys).",
      "inject18Title": "Inject 18: Media Article",
      "inject18Content": "A media outlet has released an article outlining the incident and critiquing the organisation's data collection and privacy practices. The article cites an anonymous source within the company."
    },
    "deepfakeCfo": {
      "title": "Scenario: The \"Deepfake\" CFO",
      "difficulty": "Easy",
      "description": "A Finance employee receives a video call from the CFO requesting an urgent, secret transfer. The audio and video are AI-generated (Deepfake). Based on the Arup case (Hong Kong, Feb 2024).",
      "briefingTitle": "Briefing & Setup",
      "briefingPublic": "Welcome to the Tabletop Exercise.\n\nScenario: AI-Driven Business Email Compromise (Deepfake)\n\nRules:\n1. Discuss actions as a team.\n2. Facilitator sets Difficulty (Routine 5+, Challenging 10+, Hard 15+).\n3. Roll D20 to succeed.\n\nStatus: Normal operations.",
      "briefingFacilitator": "Prepare the team for an AI-driven social engineering scenario. The CFO is at a conference (public on LinkedIn). Real-Life Reference: The Arup Case (Hong Kong, Feb 2024) - A finance worker was tricked into paying $25 million after a video call with deepfake CFO and colleagues.",
      "turn1Title": "Turn 1: Pre-Incident",
      "turn1Public": "A junior finance administrator reports receiving a Teams/Zoom call from the CFO. The CFO claimed to be at a conference with bad signal and requested an urgent payment to a new vendor for a \"stealth acquisition.\"",
      "turn1Facilitator": "BACKGROUND: The real CFO is indeed at a conference (public knowledge on LinkedIn), but they did not make the call.\n\nThe attacker is using real-time face-swapping software and voice cloning.",
      "turn2Title": "Turn 2: Response",
      "turn2Public": "The finance admin is stressed. They received a follow-up email (spoofed header) with the invoice attached.\n\nAnother employee in HR mentions seeing the CFO \"online\" at 3 AM last night requesting employee data, which seemed odd.",
      "turn2Facilitator": "BACKGROUND: The email contains a link to a fake login portal (credential harvester).\n\nThe attacker is trying to pivot from financial fraud to data theft if the payment doesn't go through.",
      "turn3Title": "Turn 3: Recovery",
      "turn3Public": "The real CFO responds to a text message confirming they never made the call.\n\nThe finance admin asks if they should click the link in the email to \"cancel\" the invoice.",
      "turn3Facilitator": "BACKGROUND: If the admin clicks the link, their credentials are stolen immediately.\n\nThe video call was pre-recorded loops mixed with AI lip-syncing.",
      "inject5Title": "Inject 5: Stakeholder Calls (SCAMMER)",
      "inject5Content": "A \"lawyer\" calls demanding the payment be expedited or the \"deal will fall through.\" (PRIVATE NOTE: This is the SCAMMER calling)",
      "inject9Title": "Inject 9: Internet Connectivity Lost",
      "inject9Content": "Internet connectivity is lost for (D20) minutes. The attacker is attempting to disrupt communication while waiting for the transfer."
    },
    "poisonedPackage": {
      "title": "Scenario: The Poisoned Package",
      "difficulty": "Medium",
      "description": "A developer accidentally includes a malicious open-source library. It has been dormant for weeks but is now beaconing to a C2 server. Based on XZ Utils backdoor (CVE-2024-3094) and Polyfill.io (2024).",
      "briefingTitle": "Briefing & Setup",
      "briefingPublic": "Welcome to the Tabletop Exercise.\n\nScenario: Software Supply Chain Attack (NPM/PyPI Typosquatting)\n\nRules:\n1. Discuss actions as a team.\n2. Facilitator sets Difficulty (Routine 5+, Challenging 10+, Hard 15+).\n3. Roll D20 to succeed.\n\nStatus: Normal operations.",
      "briefingFacilitator": "Prepare the team for a supply chain attack scenario. Real-Life References: XZ Utils Backdoor (CVE-2024-3094, Mar 2024) - malicious maintainer inserted backdoor; Polyfill.io (Jun 2024) - domain bought by attacker, injected malware into 100k+ websites.",
      "turn1Title": "Turn 1: Pre-Incident",
      "turn1Public": "The Security Operations Center (SOC) or a firewall automated alert flags \"suspicious outbound traffic\" from a production server to an unknown IP address in Eastern Europe.",
      "turn1Facilitator": "BACKGROUND: A developer installed a package named react-dom-animations (fake) instead of the legitimate library 2 weeks ago.\n\nThe malware was on a timer (delayed execution) to evade sandbox testing.",
      "turn2Title": "Turn 2: Response",
      "turn2Public": "The traffic is confirmed to be HTTPS C2 beacons.\n\nThe server in question hosts the customer-facing web portal.\n\nUsers are reporting the website is loading slowly or triggering their own antivirus.",
      "turn2Facilitator": "BACKGROUND: The malicious package injects a crypto-miner (distraction) AND a script that skims credit card inputs (the real threat).\n\nThe skimming script is obfuscated inside a standard looking CSS file.",
      "turn3Title": "Turn 3: Recovery",
      "turn3Public": "The server is isolated.\n\nDevOps wants to simply \"redeploy\" the last build, not realizing the malicious package is hardcoded in the package.json file of the repository.",
      "turn3Facilitator": "BACKGROUND: If they redeploy without scrubbing the code, the infection returns immediately.\n\nThe attacker has already harvested 500+ credit card numbers.",
      "inject20Title": "Inject 20: External Repository Compromised",
      "inject20Content": "News breaks that a popular open-source maintainer's account was hacked. An external repository was recently compromised.",
      "inject17Title": "Inject 17: Customer Fraud Alerts",
      "inject17Content": "Customer helpdesk starts to receive multiple calls from customers asking about the security of their information. Fraud alerts are appearing on their cards."
    },
    "hypervisorRansomware": {
      "title": "Scenario: Hypervisor Ransomware",
      "difficulty": "Hard",
      "description": "Attackers exploit a vulnerability in the virtualization layer (ESXi/Hyper-V), encrypting virtual disks of multiple servers at once. They have also exfiltrated data. Based on ESXiArgs and Akira ransomware campaigns (2024).",
      "briefingTitle": "Briefing & Setup",
      "briefingPublic": "Welcome to the Tabletop Exercise.\n\nScenario: Ransomware targeting Virtualization & Double Extortion\n\nRules:\n1. Discuss actions as a team.\n2. Facilitator sets Difficulty (Routine 5+, Challenging 10+, Hard 15+).\n3. Roll D20 to succeed.\n\nStatus: Normal operations.",
      "briefingFacilitator": "Prepare the team for a hypervisor ransomware scenario. Real-Life Reference: ESXiArgs Campaign & Akira Ransomware (2024) - targeted unpatched VMware ESXi servers, exfiltrated data before encryption (Double Extortion).",
      "turn1Title": "Turn 1: Pre-Incident",
      "turn1Public": "IT Admins report they cannot log into the Virtual Machine management console.\n\nSimultaneously, the \"File Server\" and \"Database\" VMs go offline. A readme.txt file is found on the management datastore.",
      "turn1Facilitator": "BACKGROUND: The attackers used a zero-day or unpatched vulnerability in the hypervisor (not the Windows VMs themselves).\n\nThey have encrypted the .vmdk (virtual disk) files directly.",
      "turn2Title": "Turn 2: Response",
      "turn2Public": "A ransom note is emailed to the CEO and IT Director. It links to a Tor site showing screenshots of your customer database.\n\nThey demand $2M in Bitcoin within 48 hours or they will publish the data.",
      "turn2Facilitator": "BACKGROUND: The attackers have been in the network for 14 days (\"dwelling\").\n\nThey have exfiltrated the data before encrypting. This is a \"Double Extortion\" attack.",
      "turn3Title": "Turn 3: Recovery",
      "turn3Public": "Media outlets are calling asking about a \"data leak\" mentioned on a cybercrime forum.\n\nYou have located an offline \"cold\" backup from 3 months ago.",
      "turn3Facilitator": "BACKGROUND: Restoring from 3 months ago means losing a quarter of financial data.\n\nThe attackers still have the stolen data and may release it regardless of payment.",
      "inject13Title": "Inject 13: Hot Backups Don't Work",
      "inject13Content": "Hot backups do not work. The backup server was also a VM on the same cluster and is encrypted.",
      "inject14Title": "Inject 14: Worldwide Attack Series",
      "inject14Content": "It emerges that this is part of a worldwide series of attacks. A patch was released yesterday, but you missed the window."
    }
  }
}
