{
  "landing": {
    "title": "ROLLS & RESPONDERS",
    "subtitle": "La simulation de gestion d'incidents cyber",
    "selectScenario": "Sélectionner le Scénario",
    "facilitatorConsole": "Console de l'Animateur",
    "facilitatorDesc": "Contrôlez le scénario, consultez les informations d'arrière-plan cachées, déclenchez des injects et gérez le déroulement du jeu.",
    "playerDisplay": "Affichage Joueur",
    "playerDesc": "Lancez cette vue sur un écran partagé. Affiche les journaux publics, les lancers de dés et l'état actuel du scénario.",
    "tip": "Astuce : Ouvrez cette URL dans deux onglets/fenêtres séparés pour utiliser les deux modes simultanément."
  },
  "header": {
    "facilitator": "Animateur",
    "turn": "Tour",
    "resetGame": "Réinitialiser le Jeu",
    "exit": "Quitter",
    "exitPlayerMode": "Quitter le Mode Joueur"
  },
  "facilitator": {
    "currentPhase": "Phase Actuelle",
    "nextTurn": "Tour Suivant",
    "readToPlayers": "Lire aux Joueurs",
    "resendToLog": "Renvoyer au Journal Joueur",
    "facilitatorOnly": "Réservé à l'Animateur",
    "availableInjects": "Injects Disponibles",
    "trigger": "DÉCLENCHER",
    "actionResolution": "Résolution d'Action",
    "normalRoll": "Lancer Normal",
    "advantage": "Avantage",
    "disadvantage": "Désavantage",
    "rollTakeHigh": "Lancer 2, Prendre Haut",
    "rollTakeLow": "Lancer 2, Prendre Bas",
    "difficulty": "Difficulté",
    "roll": "Lancer",
    "example": "Exemple",
    "playerScreenLog": "Aperçu du Journal Écran Joueur",
    "noEvents": "Aucun événement pour le moment...",
    "resetConfirm": "Réinitialiser tout le jeu ? Cela effacera tous les progrès et journaux."
  },
  "player": {
    "incidentActive": "INCIDENT ACTIF",
    "currentPhase": "Phase Actuelle",
    "criticalUpdate": "Mise à Jour Critique",
    "actionRollResult": "Résultat du Lancer d'Action",
    "waiting": "En attente des mises à jour de l'animateur...",
    "referenceData": "Données de Référence",
    "difficultyChecks": "Vérifications de Difficulté",
    "routine": "Routine",
    "challenging": "Difficile",
    "hard": "Très Difficile",
    "turnStructure": "Structure des Tours",
    "pastInject": "Inject Passé"
  },
  "difficulty": {
    "trivial": "Trivial",
    "routine": "Routine",
    "challenging": "Difficile",
    "hard": "Très Difficile",
    "eliteHacker": "Hacker d'Élite",
    "noRoll": "Pas de Lancer",
    "checkingComms": "Vérifier Slack/Email",
    "examiningLogs": "Examiner les Journaux",
    "unfamiliarTool": "Outil Inconnu / Revue de Code",
    "restoringBackups": "Restaurer sauvegardes verrouillées / Corriger IAM",
    "complexWizardry": "Sorcellerie technique hautement complexe"
  },
  "log": {
    "advancedTo": "Passé à",
    "rolled": "Lancé",
    "actionRoll": "Lancer d'Action :"
  },
  "scenarios": {
    "ddosAttack": {
      "title": "Scénario : Déni de Service Distribué (DDoS)",
      "difficulty": "Facile",
      "description": "Une attaque DDoS cible votre organisation. L'attaque DDoS provient d'un service de stress payant embauché par un groupe de criminels cherchant à extorquer votre organisation pour du Bitcoin. Les clients et les parties prenantes seniors deviennent irrités.",
      "briefingTitle": "Briefing & Configuration",
      "briefingPublic": "Bienvenue à l'Exercice de Table.\n\nScénario : Attaque DDoS\n\nRègles :\n1. Discutez des actions en équipe.\n2. L'animateur définit la Difficulté (Routine 5+, Difficile 10+, Très Difficile 15+).\n3. Lancez D20 pour réussir.\n\nStatut : Opérations normales.",
      "briefingFacilitator": "Préparez l'équipe pour un scénario DDoS. Assurez-vous que les rôles sont assignés.",
      "turn1Title": "Tour 1 : Pré-Incident",
      "turn1Public": "Les membres du personnel commencent à recevoir des appels de clients se plaignant de ne pas pouvoir utiliser des services importants.",
      "turn1Facilitator": "CONTEXTE : Un service de stress payant (embauché par des cybercriminels) effectue une attaque DDoS contre l'organisation dans l'espoir d'extorquer du Bitcoin (remplacer si non pertinent pour l'organisation).\n\nL'attaque DDoS cible le site Web de l'organisation. Le trafic réseau contient du HTTPS malformé et provient principalement de pays voisins.",
      "turn2Title": "Tour 2 : Incident Déclaré",
      "turn2Public": "Les membres du personnel reçoivent des appels, des emails et des messages se plaignant de pannes.",
      "turn2Facilitator": "CONTEXTE : Les attaques DDoS continuent. En conséquence, les clients deviennent agités. Certains membres du personnel senior sont maintenant au courant de l'incident.\n\nLes criminels ont envoyé un email demandant un paiement.",
      "turn3Title": "Tour 3 : Récupération",
      "turn3Public": "L'attaque DDoS a cessé.\n\nLa direction senior et les parties prenantes importantes demandent un résumé de l'incident.",
      "turn3Facilitator": "CONTEXTE : L'attaque s'est terminée. Des articles de presse sur l'attaque DDoS de votre organisation circulent en ligne.",
      "inject11Title": "Inject 11 : Demande de Rançon",
      "inject11Content": "Un membre du personnel senior reçoit un email des criminels exigeant que l'entreprise paie (D20) Bitcoin pour arrêter l'attaque DDoS.",
      "inject8Title": "Inject 8 : Menace d'Escalade",
      "inject8Content": "L'attaquant envoie un email incluant des captures d'écran de plaintes de clients sur les réseaux sociaux et menace de plus d'attaques cyber si les demandes ne sont pas satisfaites (NOTE PRIVÉE : AUTHENTIQUE)",
      "inject6Title": "Inject 6 : Appel d'une Partie Prenante",
      "inject6Content": "Une partie prenante importante/un membre du conseil appelle pour connaître le statut"
    },
    "ransomware": {
      "title": "Scénario : Attaque par Rançongiciel",
      "difficulty": "Moyen",
      "description": "Attaque par rançongiciel menée par des testeurs de sécurité embauchés. Ordinateur portable administrateur compromis, l'utilisateur a signalé que la machine démarre sur un écran de rançongiciel. Clé USB discrète dans l'un des ports.",
      "briefingTitle": "Briefing & Configuration",
      "briefingPublic": "Bienvenue à l'Exercice de Table.\n\nScénario : Rançongiciel\n\nRègles :\n1. Discutez des actions en équipe.\n2. L'animateur définit la Difficulté (Routine 5+, Difficile 10+, Très Difficile 15+).\n3. Lancez D20 pour réussir.\n\nStatut : Opérations normales.",
      "briefingFacilitator": "Préparez l'équipe pour un scénario de rançongiciel.",
      "turn1Title": "Tour 1 : Pré-Incident",
      "turn1Public": "Un membre du personnel a contacté l'IT, signalant que leur machine démarre sur un écran de rançongiciel.\n\nIls ont des privilèges administrateur.\n\nLa machine fonctionnait bien le matin, l'utilisateur n'a remarqué le problème qu'après le déjeuner.\n\nAucun autre problème signalé.",
      "turn1Facilitator": "CONTEXTE : Un testeur de sécurité, embauché par l'entreprise, a réussi à accéder à la zone de bureau utilisée par le personnel avec des privilèges administrateur.\n\nIls ont inséré une clé USB discrète dans l'un des ordinateurs portables administrateur pendant que l'utilisateur était absent.\n\nElle contient une charge utile de rançongiciel, qui vient de se déployer. Le disque a été chiffré, mais aucune donnée n'est en cours d'exfiltration.",
      "turn2Title": "Tour 2 : Phase de Réponse",
      "turn2Public": "Le membre du personnel panique, inquiet de perdre son emploi. Il revient sans cesse vers l'IT pour demander s'il y a eu des progrès.\n\nPlus d'utilisateurs signalent que leurs machines ont maintenant les mêmes écrans de rançongiciel.",
      "turn2Facilitator": "CONTEXTE : Le testeur est toujours dans le bâtiment et a réussi à infecter D6 machines supplémentaires.\n\nLe testeur partira plus tard dans ce tour.",
      "turn3Title": "Tour 3 : Récupération",
      "turn3Public": "Avance rapide d'une semaine. La direction révèle à l'équipe que l'événement de rançongiciel faisait partie d'un test de sécurité.",
      "turn3Facilitator": "CONTEXTE : Le test est terminé.",
      "inject13Title": "Inject 13 : Problèmes de Sauvegarde",
      "inject13Content": "Les sauvegardes à chaud ne fonctionnent pas. Les sauvegardes hors site prendront (D6) heures à récupérer."
    },
    "cloudCompromise": {
      "title": "Scénario : Compromission de l'Infrastructure Cloud",
      "difficulty": "Difficile",
      "description": "L'organisation a vu son infrastructure cloud compromise par un attaquant, conduisant à l'exfiltration de données personnelles et à une attention médiatique indésirable.",
      "briefingTitle": "Briefing & Configuration",
      "briefingPublic": "Bienvenue à l'Exercice de Table.\n\nScénario : Compromission de l'Infrastructure Cloud\n\nRègles :\n1. Discutez des actions en équipe.\n2. L'animateur définit la Difficulté (Routine 5+, Difficile 10+, Très Difficile 15+).\n3. Lancez D20 pour réussir.\n\nStatut : Opérations normales.",
      "briefingFacilitator": "Préparez l'équipe pour un scénario de compromission cloud impliquant des données personnelles.",
      "turn1Title": "Tour 1 : Pré-Incident",
      "turn1Public": "Les administrateurs IT de l'organisation ont reçu un email des forces de l'ordre vous notifiant de connexions malveillantes à votre infrastructure cloud.",
      "turn1Facilitator": "CONTEXTE : L'infrastructure cloud de l'organisation a été compromise en raison d'une mauvaise configuration (clés d'accès exposées).\n\nL'attaquant a utilisé cet accès pour accéder à un bucket d'hébergement, téléchargeant des données personnelles sur les clients.",
      "turn2Title": "Tour 2 : Phase de Réponse",
      "turn2Public": "Un membre du personnel trouve une capture d'écran sur les réseaux sociaux montrant des données personnelles des clients de l'organisation.",
      "turn2Facilitator": "CONTEXTE : L'attaquant a commencé à divulguer des échantillons de données personnelles sur un forum darknet et propose de vendre l'ensemble complet à quiconque en ligne. Des captures d'écran de ces échantillons sont publiées sur les réseaux sociaux.\n\nL'attaquant continue d'avoir accès jusqu'à ce qu'il soit supprimé et empêché de retrouver l'accès (par exemple, rotation de la clé d'accès et correction de la mauvaise configuration).",
      "turn3Title": "Tour 3 : Récupération",
      "turn3Public": "Aucune information supplémentaire (Vous voudrez peut-être fournir un résumé de l'état actuel de l'attaque).",
      "turn3Facilitator": "CONTEXTE : L'attaquant continue d'avoir accès jusqu'à ce qu'il soit supprimé et empêché de retrouver l'accès.",
      "inject12Title": "Inject 12 : Avertissement d'un Chercheur",
      "inject12Content": "Un membre du personnel trouve un email vieux de plusieurs mois dans lequel un chercheur détaille la mauvaise configuration (clés d'accès exposées).",
      "inject18Title": "Inject 18 : Article Médiatique",
      "inject18Content": "Un média a publié un article décrivant l'incident et critiquant les pratiques de collecte de données et de confidentialité de l'organisation. L'article cite une source anonyme au sein de l'entreprise."
    },
    "deepfakeCfo": {
      "title": "Scénario : Le Directeur Financier \"Deepfake\"",
      "difficulty": "Facile",
      "description": "Un employé des finances reçoit un appel vidéo du directeur financier demandant un virement urgent et secret. L'audio et la vidéo sont générés par IA (Deepfake). Basé sur l'affaire Arup (Hong Kong, fév 2024).",
      "briefingTitle": "Briefing & Configuration",
      "briefingPublic": "Bienvenue à l'Exercice de Table.\n\nScénario : Compromission d'Email Professionnel par IA (Deepfake)\n\nRègles :\n1. Discutez des actions en équipe.\n2. L'animateur définit la Difficulté (Routine 5+, Difficile 10+, Très Difficile 15+).\n3. Lancez D20 pour réussir.\n\nStatut : Opérations normales.",
      "briefingFacilitator": "Préparez l'équipe pour un scénario d'ingénierie sociale par IA. Le directeur financier est à une conférence (information publique sur LinkedIn). Référence réelle : L'affaire Arup (Hong Kong, fév 2024) - Un employé financier a été piégé pour payer 25 millions de dollars après un appel vidéo avec un directeur financier et des collègues en deepfake.",
      "turn1Title": "Tour 1 : Pré-Incident",
      "turn1Public": "Un administrateur financier junior signale avoir reçu un appel Teams/Zoom du directeur financier. Le directeur affirmait être à une conférence avec un mauvais signal et demandait un paiement urgent à un nouveau fournisseur pour une \"acquisition furtive\".",
      "turn1Facilitator": "CONTEXTE : Le vrai directeur financier est effectivement à une conférence (information publique sur LinkedIn), mais il n'a pas passé l'appel.\n\nL'attaquant utilise un logiciel d'échange de visage en temps réel et de clonage vocal.",
      "turn2Title": "Tour 2 : Réponse",
      "turn2Public": "L'administrateur financier est stressé. Il a reçu un email de suivi (en-tête usurpé) avec la facture en pièce jointe.\n\nUn autre employé des RH mentionne avoir vu le directeur financier \"en ligne\" à 3h du matin la nuit dernière demandant des données d'employés, ce qui semblait étrange.",
      "turn2Facilitator": "CONTEXTE : L'email contient un lien vers un faux portail de connexion (récupérateur de credentials).\n\nL'attaquant tente de pivoter de la fraude financière au vol de données si le paiement n'est pas effectué.",
      "turn3Title": "Tour 3 : Récupération",
      "turn3Public": "Le vrai directeur financier répond à un SMS confirmant qu'il n'a jamais passé l'appel.\n\nL'administrateur financier demande s'il doit cliquer sur le lien dans l'email pour \"annuler\" la facture.",
      "turn3Facilitator": "CONTEXTE : Si l'administrateur clique sur le lien, ses credentials sont volés immédiatement.\n\nL'appel vidéo était des boucles pré-enregistrées mélangées avec une synchronisation labiale par IA.",
      "inject5Title": "Inject 5 : Appels de Partie Prenante (ESCROC)",
      "inject5Content": "Un \"avocat\" appelle exigeant que le paiement soit accéléré ou \"l'affaire échouera\". (NOTE PRIVÉE : C'est l'ESCROC qui appelle)",
      "inject9Title": "Inject 9 : Perte de Connectivité Internet",
      "inject9Content": "La connectivité Internet est perdue pendant (D20) minutes. L'attaquant tente de perturber la communication en attendant le virement."
    },
    "poisonedPackage": {
      "title": "Scénario : Le Package Empoisonné",
      "difficulty": "Moyen",
      "description": "Un développeur inclut accidentellement une bibliothèque open-source malveillante. Elle est restée dormante pendant des semaines mais émet maintenant vers un serveur C2. Basé sur la backdoor XZ Utils (CVE-2024-3094) et Polyfill.io (2024).",
      "briefingTitle": "Briefing & Configuration",
      "briefingPublic": "Bienvenue à l'Exercice de Table.\n\nScénario : Attaque de la Chaîne d'Approvisionnement Logicielle (Typosquatting NPM/PyPI)\n\nRègles :\n1. Discutez des actions en équipe.\n2. L'animateur définit la Difficulté (Routine 5+, Difficile 10+, Très Difficile 15+).\n3. Lancez D20 pour réussir.\n\nStatut : Opérations normales.",
      "briefingFacilitator": "Préparez l'équipe pour un scénario d'attaque de la chaîne d'approvisionnement. Références réelles : Backdoor XZ Utils (CVE-2024-3094, mar 2024) - un mainteneur malveillant a inséré une backdoor ; Polyfill.io (juin 2024) - domaine acheté par un attaquant, malware injecté dans 100k+ sites web.",
      "turn1Title": "Tour 1 : Pré-Incident",
      "turn1Public": "Le Centre des Opérations de Sécurité (SOC) ou une alerte automatique du pare-feu signale un \"trafic sortant suspect\" d'un serveur de production vers une adresse IP inconnue en Europe de l'Est.",
      "turn1Facilitator": "CONTEXTE : Un développeur a installé un package nommé react-dom-animations (faux) au lieu de la bibliothèque légitime il y a 2 semaines.\n\nLe malware était sur une minuterie (exécution différée) pour échapper aux tests en bac à sable.",
      "turn2Title": "Tour 2 : Réponse",
      "turn2Public": "Le trafic est confirmé être des balises C2 HTTPS.\n\nLe serveur en question héberge le portail web destiné aux clients.\n\nLes utilisateurs signalent que le site web se charge lentement ou déclenche leur propre antivirus.",
      "turn2Facilitator": "CONTEXTE : Le package malveillant injecte un crypto-mineur (distraction) ET un script qui écume les entrées de carte de crédit (la vraie menace).\n\nLe script d'écrémage est obfusqué à l'intérieur d'un fichier CSS d'apparence standard.",
      "turn3Title": "Tour 3 : Récupération",
      "turn3Public": "Le serveur est isolé.\n\nLes DevOps veulent simplement \"redéployer\" le dernier build, ne réalisant pas que le package malveillant est codé en dur dans le fichier package.json du dépôt.",
      "turn3Facilitator": "CONTEXTE : S'ils redéploient sans nettoyer le code, l'infection revient immédiatement.\n\nL'attaquant a déjà récolté plus de 500 numéros de carte de crédit.",
      "inject20Title": "Inject 20 : Dépôt Externe Compromis",
      "inject20Content": "Des actualités révèlent que le compte d'un mainteneur open-source populaire a été piraté. Un dépôt externe a été récemment compromis.",
      "inject17Title": "Inject 17 : Alertes de Fraude Client",
      "inject17Content": "Le service d'assistance client commence à recevoir plusieurs appels de clients s'interrogeant sur la sécurité de leurs informations. Des alertes de fraude apparaissent sur leurs cartes."
    },
    "hypervisorRansomware": {
      "title": "Scénario : Rançongiciel Hyperviseur",
      "difficulty": "Très Difficile",
      "description": "Les attaquants exploitent une vulnérabilité dans la couche de virtualisation (ESXi/Hyper-V), chiffrant les disques virtuels de plusieurs serveurs à la fois. Ils ont également exfiltré des données. Basé sur les campagnes ESXiArgs et Akira ransomware (2024).",
      "briefingTitle": "Briefing & Configuration",
      "briefingPublic": "Bienvenue à l'Exercice de Table.\n\nScénario : Rançongiciel ciblant la Virtualisation & Double Extorsion\n\nRègles :\n1. Discutez des actions en équipe.\n2. L'animateur définit la Difficulté (Routine 5+, Difficile 10+, Très Difficile 15+).\n3. Lancez D20 pour réussir.\n\nStatut : Opérations normales.",
      "briefingFacilitator": "Préparez l'équipe pour un scénario de rançongiciel hyperviseur. Référence réelle : Campagne ESXiArgs & Akira Ransomware (2024) - a ciblé des serveurs VMware ESXi non corrigés, exfiltré des données avant chiffrement (Double Extorsion).",
      "turn1Title": "Tour 1 : Pré-Incident",
      "turn1Public": "Les administrateurs IT signalent qu'ils ne peuvent pas se connecter à la console de gestion de Machine Virtuelle.\n\nSimultanément, les VM \"Serveur de Fichiers\" et \"Base de Données\" se déconnectent. Un fichier readme.txt est trouvé sur le datastore de gestion.",
      "turn1Facilitator": "CONTEXTE : Les attaquants ont utilisé une vulnérabilité zero-day ou non corrigée dans l'hyperviseur (pas dans les VM Windows elles-mêmes).\n\nIls ont chiffré les fichiers .vmdk (disque virtuel) directement.",
      "turn2Title": "Tour 2 : Réponse",
      "turn2Public": "Une note de rançon est envoyée par email au PDG et au Directeur IT. Elle renvoie à un site Tor montrant des captures d'écran de votre base de données clients.\n\nIls exigent 2M$ en Bitcoin dans les 48 heures ou ils publieront les données.",
      "turn2Facilitator": "CONTEXTE : Les attaquants sont dans le réseau depuis 14 jours (\"période de latence\").\n\nIls ont exfiltré les données avant de chiffrer. C'est une attaque de \"Double Extorsion\".",
      "turn3Title": "Tour 3 : Récupération",
      "turn3Public": "Des médias appellent pour poser des questions sur une \"fuite de données\" mentionnée sur un forum de cybercriminalité.\n\nVous avez localisé une sauvegarde \"froide\" hors ligne vieille de 3 mois.",
      "turn3Facilitator": "CONTEXTE : Restaurer depuis 3 mois signifie perdre un quart des données financières.\n\nLes attaquants ont toujours les données volées et peuvent les publier indépendamment du paiement.",
      "inject13Title": "Inject 13 : Sauvegardes à Chaud Inopérantes",
      "inject13Content": "Les sauvegardes à chaud ne fonctionnent pas. Le serveur de sauvegarde était également une VM sur le même cluster et est chiffré.",
      "inject14Title": "Inject 14 : Série d'Attaques Mondiales",
      "inject14Content": "Il apparaît que cela fait partie d'une série mondiale d'attaques. Un correctif a été publié hier, mais vous avez manqué la fenêtre."
    }
  }
}
